'use strict'

// Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься з правильним словом: "рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

// Умови виконання ДЗ

// Рік отримувати через prompt()
// Зробити перевірку що користувачь ввів число та це число не є відємним
// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки.
// Будь ласка, надайте наступні дані для перевірки вашої роботи:

// Створіть гілку js_homework2.
// Додати туди ваше домашне завдання
// Вислати вашу гілку

let year = prompt ("Будь ласка, введіть рік:");
year = parseInt (year); 


if (!isNaN (year) && year >= 0) {
    
    if (year === 1 || (year % 10 === 1 && year % 100 !== 11)) {
        alert(year + " рік");
    } else if (year > 1 && year < 5 || (year % 10 > 1 && year % 10 < 5 && (year % 100 < 10 || year % 100 >= 20))) {
        alert(year + " роки");
    } else {
        alert(year + " років");
    }
} else {
    alert("Будь ласка, введіть невід'ємне число!");
}